text = """” Любіть Україну, як сонце, любіть,
            як вітер, і трави, і води…
            В годину щасливу і в радості мить,
            любіть у годину негоди.
            Любіть Україну у сні й наяву,
            вишневу свою Україну,
            красу її, вічно живу і нову,
            і мову її солов’їну.
            Між братніх народів, мов садом рясним,
            сіяє вона над віками…
            Любіть Україну всім серцем своїм
            і всіми своїми ділами.
            Для нас вона в світі єдина, одна
            в просторів солодкому чарі…
            Вона у зірках, і у вербах вона,
            і в кожному серця ударі,
            у квітці, в пташині, в електровогнях,
            у пісні у кожній, у думі,
            в дитячий усмішці, в дівочих очах
            і в стягів багряному шумі… ”"""

words = text.split()
cleaned_words = [word.strip('.,:!?”') for word in words]
x = {}
for word in cleaned_words:
    if word in x:
        x[word] += 1
    else:
        x[word] = 1
x_y = max(x, key=x.get)
y_x = x[x_y]
print(f"Найбільше зустрічається слово: '{x_y}' ({y_x} разів)")
x_y = min(x, key=x.get)
y_x = x[x_y]
print(f"Найменше зустрічається слово: '{x_y}' ({y_x} разів)")
